In [54]:
import pandas as pd

In [55]:
data=pd.read_csv(r'C:\Users\deyar\OneDrive\Desktop\Flight_Ticket_Price_Prediction\notebooks\data\flight.csv')

In [56]:
data.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [57]:
data.drop(["Unnamed: 0","flight"],axis=1,inplace=True)

In [58]:
data.head(2)

,airline,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,SpiceJet,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,SpiceJet,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953

In [59]:
cat=[]
num=[]
for i in data.columns:
    if data[i].dtype=='object':
        cat.append(i)
    else:
        num.append(i)

In [60]:
data_cat=data[cat]

In [61]:
data_num=data[num]

In [62]:
import warnings

In [63]:
warnings.filterwarnings('ignore')

In [64]:
for  j in data_cat.columns:
    data_cat[j]=data_cat[j].astype('category').cat.codes

In [65]:
data=pd.concat([data_cat,data_num],axis=1)

In [66]:
data.head(2)

,airline,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,4,2,2,2,5,5,1,2.17,1,5953
1,4,2,1,2,4,5,1,2.33,1,5953

In [67]:
data_cat=data[cat]

In [68]:
data_num=data[num]

In [69]:
data_cat.head(2)

,airline,source_city,departure_time,stops,arrival_time,destination_city,class
0,4,2,2,2,5,5,1
1,4,2,1,2,4,5,1

In [70]:
data_num.head(2)

   duration  days_left  price
0      2.17          1   5953
1      2.33          1   5953

In [71]:
y=data.iloc[:,-1:]

In [72]:
y.head(2)

   price
0   5953
1   5953

In [73]:
from scipy.stats import kendalltau

In [74]:
s=[]
for i in data_cat.columns:
   coef,p=kendalltau(data_cat[i],y)
   if p<0.05:
    s.append('dependent')
   else:
     s.append("independent")

In [75]:
m=data_cat.columns

In [76]:
x1=pd.DataFrame(s,columns=['result'])

In [77]:
x2=pd.DataFrame(m,columns=['columns'])

In [78]:
pd.concat([x1,x2],axis=1)

      result           columns
0  dependent           airline
1  dependent       source_city
2  dependent    departure_time
3  dependent             stops
4  dependent      arrival_time
5  dependent  destination_city
6  dependent             class

In [79]:
data_num.head()

   duration  days_left  price
0      2.17          1   5953
1      2.33          1   5953
2      2.17          1   5956
3      2.25          1   5955
4      2.33          1   5955

In [80]:
v=data_num.corr()

In [81]:
import seaborn as sn

In [82]:
data_num.drop("price",axis=1,inplace=True)

In [83]:
from scipy.stats import spearmanr

In [84]:
o=[]
for j in data_num.columns:
    coef,p=spearmanr(data_num[j],y)
    if p<0.5:
        o.append('dependent')
    else:
        o.append('independent')

In [85]:
o

['dependent', 'dependent']

In [86]:
x1=pd.DataFrame(o,columns=['result'])

In [87]:
n=data_num.columns

In [88]:
x2=pd.DataFrame(n,columns=['columns'])

In [89]:
pd.concat([x1,x2],axis=1)

      result    columns
0  dependent   duration
1  dependent  days_left